# parameters
nc: 20  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors 
# YOLOv5 uses k-means clustering to generate the anchors
# and allocate them to different prediction layers.
# Format: [weight1,height1, weight2,height2, ...]
anchors:
  - [10,13, 16,30, 33,23]  # P3/8, used for small objects
  - [30,61, 62,45, 59,119]  # P4/16, used for medium objects
  - [116,90, 156,198, 373,326]  # P5/32, used for large objects

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # from: 表示当前层的输入来自哪一层，-1表示上一层，0表示当前层，
  # 也可以是其他层的序号，或者多个层的序号列表
  # number: 表示当前层重复的次数
  # module: 表示当前层的类型
  # args: 表示当前层的参数，层的类型不同，参数不同，比如：
    # Focus: 表示当前层是Focus模块，[64, 3]表示输入通道数为64，卷积核大小为3
    # Conv: 表示当前层是卷积层，[128, 3, 2]表示输入通道数为128，卷积核大小为3，步幅为2
    # C3: 表示当前层是C3模块，[128]表示输入通道数为128
    # SPP: 表示当前层是SPP模块，[1024, [5, 9, 13]]表示输入通道数为1024，池化核大小为5, 9, 13
    # Detect: 表示当前层是Detect模块，[nc, anchors]表示类别数为nc，anchors就是先验的anchors
    # nn.Upsample: 表示当前层是上采样层，[None, 2, 'nearest']表示上采样倍率为2，上采样方式为最近邻插值
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16 
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],  
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)  [17, 20, 23]为网络detect的输入的层序号
  ]
